Reports/Renault_ИсполнениеПланаПродажПоАвтосервису.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>Renault_ИсполнениеПланаПродажПоАвтосервису</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/Renault_ТипыПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/Renault_ИсполнениеПланаПродажПоАвтосервису/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Настройки =  КомпоновщикНастроек.ПолучитьНастройки();
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	ПараметрДатаНачала 	   = Параметры.Найти("ДатаНачала");
	ПараметрДатаОкончания  = Параметры.Найти("ДатаКонец");
	
	ПараметрДатаНачала.Значение     = Период;
	ПараметрДатаНачала.Использование = Истина;
	
	ПараметрДатаОкончания.Значение  = ДатаОкончанияПериода();
	ПараметрДатаОкончания.Использование = Истина;

	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ДокументРезультат.ФиксацияСлева = 1;
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(3);
КонецПроцедуры

Функция ДатаОкончанияПериода()
	ДатаВозврат = '0001-01-01';
	
	Если ВидПериода = Перечисления.Renault_ТипыПериода.Неделя Тогда
		ДатаВозврат = КонецНедели(Период);
	ИначеЕсли ВидПериода = Перечисления.Renault_ТипыПериода.Месяц Тогда
		ДатаВозврат = КонецМесяца(Период);
	ИначеЕсли ВидПериода = Перечисления.Renault_ТипыПериода.Квартал Тогда
		ДатаВозврат = КонецКвартала(Период);
	ИначеЕсли ВидПериода = Перечисления.Renault_ТипыПериода.Год Тогда
		ДатаВозврат = КонецГода(Период);
	КонецЕсли;
	
	Возврат ДатаВозврат;
КонецФункции
